# 背景介绍
    我有个把日常中的所思所想记录下来的习惯,比如遇到一个好的句子、脑
    中突然冒出一个灵感、上课老师布置的作业、上课中觉得非常好的思想等。
    显然这些东西需要分开记录,而且我用电脑的时候会记录在电脑上、用手
    机的时候会记录的手机上,这样长期下来电脑和手机上就都有不少东西了,
    紧接着一个问题便出现了,需要把这些东西整理在一起,以便回顾复习。
# 出现的问题
    拿课堂笔记举例：
    1. 手机上和电脑上都是从0开始编号,懒得手动更改。
    2. 电脑上是markdown格式的序号,手机上是txt格式的。
    3. 电脑上是"1. 我爱你"这样的格式,而手机上是"1、我爱你"。
# 解决方案和思路
    1. 统一用电脑上这种markdown格式。
    2. 代码总共分三步：①通过可视化窗口选择需要合并的文件
                     ②对文件进行预处理,主要是去除空行
                     ③利用python对文件的操作实现合并
# 举例
    1. 假设要合并本项目数据部分的3个文件到其中一个md文件
    2. 我们要做的是先以一个md文件为主体合并剩下的任意一个
    3. 然后再用新生成的文件合并第3个文件